// 1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
let arr1_1 = [1, 2, 3];
let arr2_1 = [4, 5, 6];
let arr3_1 = arr1_1.concat(arr2_1);
console.log(arr3_1)

// 2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].
let arr1_2 = [1, 2, 3];
arr1_2.reverse()
console.log(arr1_2)

// 3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
let arr1_3 = [1, 2, 3];
arr1_3.push(4, 5, 6)
console.log(arr1_3)

// 4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
let arr1_4 = [1, 2, 3];
arr1_4.unshift(4,5,6)
console.log(arr1_4)

// 5. Дан массив [‘js’, ‘css’, ‘jq’]. Выведите на экран первый элемент.
let arr1_5 =['js','css', 'jq']
console.log(arr1_5[0])

// 6. Дан массив [‘js’, ‘css’, ‘jq’]. Выведите на экран последний элемент.
let arr1_6 =['js','css', 'jq']
console.log(arr1_6[arr1_6.length -1])

// 7. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [1, 2, 3].
let arr1_7=[1, 2, 3, 4, 5];
let arr2_7= arr1_7.slice(0,3)
console.log(arr2_7)

// 8. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [4, 5].
let arr1_8=[1, 2, 3, 4, 5];
let arr2_8= arr1_8.slice(3,6)
console.log(arr2_8)

// 9. Дан массив [1, 2, 3, 4, 5]. С помощью метода преобразуйте массив в [1, 4, 5].
let arr1_9=[1, 2, 3, 4, 5];
arr1_9.splice(1, 2)
console.log(arr1_9)

// 10. Дан массив [1, 2, 3, 4, 5]. С помощью метода запишите в новый массив элементы [2, 3, 4].
let arr1_10 = [1, 2, 3, 4, 5];
let arr2_10 = arr1_10.slice(1, 4);
console.log(arr2_10);

// 11. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, 2, 3, ‘a’, ‘b’, ‘c’, 4, 5].
let arr1_11 = [1, 2, 3, 4, 5];
arr1_11.splice(3, 0, 'a', 'b', 'c');
console.log(arr1_11);

// 12. Дан массив [1, 2, 3, 4, 5]. С помощью метода сделайте из него массив [1, ‘a’, ‘b’, 2, 3, 4, ‘c’, 5, ‘e’].
let arr1_12 = [1, 2, 3, 4, 5];
arr1_12.splice(1, 0, 'a', 'b');
arr1_12.splice(6, 0, 'c');
arr1_12.splice(8, 0, 'e');
console.log(arr1_12);

// 13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.
let arr1_13 = [3, 4, 1, 2, 7];
arr1_13.sort()
console.log(arr1_13);

// 14. Дан массив с числами [5, 6, 7, 8, 9]. Найдите сумму этих чисел.
let arr1_14 = [5, 6, 7, 8, 9];
let sum = 0;
for (let i = 0; i < arr1_14.length; i++) {
    sum += arr1_14[i];
}console.log(sum);

// 15. Дан массив с числами [5, 6, 7, 8, 9]. Сделайте из него массив, состоящий из квадратов этих чисел.
let arr1_15 = [5, 6, 7, 8, 9];
let bob = arr1_15.map((num) => num * num)
console.log(bob);

// 16. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только отрицательные числа.
let arr1_16 = [1,-3, 5, 6,-7, 8, 9,-11];
let negNumbers = arr1_16.filter((num) => num < 0);
console.log(negNumbers);

// 17. Дан массив с числами [1,-3, 5, 6,-7, 8, 9,-11]. Оставьте в нем только четные числа.
let arr1_17 = [1,-3, 5, 6,-7, 8, 9,-11];
let countNumbers = arr1_17.filter((num) => !(num % 2));
console.log(countNumbers);

// 18. Дан массив со строками [‘aaa’, ‘aaaqqq’, ‘zzzqq’, ‘zz’, ‘qsaa’, ‘q’, ‘az’].
// Оставьте в нем только те строки, длина которых больше 5-ти символов.
let arr1_18 = ['aaa','aaaqqq', 'zzzqq', 'zz', 'qsaa', 'q','az'];
let newArray = arr1_18.filter((item) => item.length > 5 )
console.log(newArray);

// 19. Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. Оставьте в нем только подмассивы.
let arr1_19 = [1, 2, [3, 4], 5, [6, 7]];
let arr2_18 = arr1_19.filter((item) => Array.isArray(item));
console.log(arr2_18)

// 20. Дан массив с числами [5,-3, 6,-5, 0,-7, 8, 9]. Посчитайте количество отрицательных чисел в этом массиве.
let arr1_20 = [5,-3, 6,-5, 0,-7, 8, 9];
let numbOfNegNumbers = 0;
for (let i = 0; i < arr1_20.length; i++) {
    if (arr1_20[i] < 0){
        numbOfNegNumbers += 1
    }
}console.log(numbOfNegNumbers);